---
title: "Amazon Web Services S3 connector for Microsoft Sentinel"
description: "Learn how to install the connector Amazon Web Services S3 to connect your data source to Microsoft Sentinel."
author: cwatson-cat
ms.topic: how-to
ms.date: 04/26/2024
ms.service: microsoft-sentinel
ms.author: cwatson
ms.collection: sentinel-data-connector
---

# Amazon Web Services S3 connector for Microsoft Sentinel

This connector allows you to ingest AWS service logs, collected in AWS S3 buckets, to Microsoft Sentinel. The currently supported data types are: 
* AWS CloudTrail
* VPC Flow Logs
* AWS GuardDuty
* AWSCloudWatch

For more information, see the [Microsoft Sentinel documentation](https://go.microsoft.com/fwlink/p/?linkid=2218883&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).

This is autogenerated content. For changes, contact the solution provider.

## Connector attributes

| Connector attribute | Description |
| --- | --- |
| **Log Analytics table(s)** | AWSGuardDuty<br/> AWSVPCFlow<br/> AWSCloudTrail<br/> AWSCloudWatch<br/>|
| **Data collection rules support** | [Supported as listed](/azure/azure-monitor/logs/tables-feature-support) |
| **Supported by** | [Microsoft Corporation](https://support.microsoft.com) |

## Query samples

**High severity findings summarized by activity type**

   ```kusto
AWSGuardDuty
            
   | where Severity > 7
            
   | summarize count() by ActivityType
   ```

**Top 10 rejected actions of type IPv4**

   ```kusto
AWSVPCFlow
            
   | where Action == "REJECT"
            
   | where Type == "IPv4"
            
   | take 10
   ```

**User creation events summarized by region**

   ```kusto
AWSCloudTrail
            
   | where EventName == "CreateUser"
            
   | summarize count() by AWSRegion
   ```



## Prerequisites

To integrate with Amazon Web Services S3 make sure you have: 

- **Environment**: you must have the following AWS resources defined and configured: S3, Simple Queue Service (SQS), IAM roles and permissions policies, and the AWS services whose logs you want to collect.


## Vendor installation instructions

1. Set up your AWS environment

The​re are two options for setting up your AWS environment to send logs from an S3 bucket to your Log Analytics Workspace:


2. Add connection




## Next steps

For more information, go to the [related solution](https://azuremarketplace.microsoft.com/en-us/marketplace/apps/azuresentinel.azure-sentinel-solution-amazonwebservices?tab=Overview) in the Azure Marketplace.
