---
title: "[Recommended] Fortinet via AMA connector for Microsoft Sentinel"
description: "Learn how to install the connector [Recommended] Fortinet via AMA to connect your data source to Microsoft Sentinel."
author: cwatson-cat
ms.topic: how-to
ms.date: 05/30/2024
ms.service: microsoft-sentinel
ms.author: cwatson
ms.collection: sentinel-data-connector
---

# [Recommended] Fortinet via AMA connector for Microsoft Sentinel

The Fortinet firewall connector allows you to easily connect your Fortinet logs with Microsoft Sentinel, to view dashboards, create custom alerts, and improve investigation. This gives you more insight into your organization's network and improves your security operation capabilities.

This is autogenerated content. For changes, contact the solution provider.

## Connector attributes

| Connector attribute | Description |
| --- | --- |
| **Log Analytics table(s)** | CommonSecurityLog (Fortinet)<br/> |
| **Data collection rules support** | [Workspace transform DCR](/azure/azure-monitor/logs/tutorial-workspace-transformations-portal) |
| **Supported by** | [Microsoft Corporation](https://support.microsoft.com) |

## Query samples

**All logs**

   ```kusto

CommonSecurityLog

   | where DeviceVendor == "Fortinet"

   | where DeviceProduct startswith "Fortigate"

            
   | sort by TimeGenerated
   ```

**Summarize by destination IP and port**

   ```kusto

CommonSecurityLog

   | where DeviceVendor == "Fortinet"

   | where DeviceProduct startswith "Fortigate"

            
   | summarize count() by DestinationIP, DestinationPort, TimeGenerated​
            
   | sort by TimeGenerated
   ```



## Prerequisites

To integrate with [Recommended] Fortinet via AMA make sure you have: 

- To collect data from non-Azure VMs, they must have Azure Arc installed and enabled. [Learn more](/azure/azure-monitor/agents/azure-monitor-agent-install?tabs=ARMAgentPowerShell,PowerShellWindows,PowerShellWindowsArc,CLIWindows,CLIWindowsArc)
- Common Event Format (CEF) via AMA and Syslog via AMA data connectors must be installed [Learn more](/azure/sentinel/connect-cef-ama#open-the-connector-page-and-create-the-dcr)


## Vendor installation instructions



2. Secure your machine 

Make sure to configure the machine's security according to your organization's security policy


[Learn more >](https://aka.ms/SecureCEF)



## Next steps

For more information, go to the [related solution](https://azuremarketplace.microsoft.com/en-us/marketplace/apps/azuresentinel.azure-sentinel-solution-fortinetfortigate?tab=Overview) in the Azure Marketplace.
