---
title: Azure Sentinel DNS normalization schema reference | Microsoft Docs
description: This article describes the Azure Sentinel DNS normalization schema.
services: sentinel
cloud: na
documentationcenter: na
author: batamig
manager: rkarlin

ms.assetid:
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.workload: na
ms.tgt_pltfrm: na
ms.devlang: na
ms.topic: reference
ms.date: 5/24/2021
ms.author: bagol

---

# Azure Sentinel DNS normalization schema reference (Public preview)

The DNS information model is used to describe events reported by a DNS server or a DNS security system. It is used by Azure Sentinel to enable source agnostic analytics.

## Guidelines for collecting DNS events

DNS is a unique protocol, as a single request may traverse a large number of computers. Also, since it uses UDP, requests and responses are de-couped and are not directly related to each other.
The diagram below presents a simplified DNS request flow. A real world request can be more complex and include more segments. As you can see, a single request may involve four (and often more) segments. 

:::image type="content" source="media/dns-request-flow.png" alt-text="Simplified DNS request flow.":::

Since the segments are not directly connected to each other, full logging can result in significant duplication. The most valuable segment to log is the response to the client. It provides the domain name queries, the lookup result and the IP address of the client. Many DNS systems logs only this segment. There might be some value in logging other parts, for example the DNS cache poisoning attack often take advantage of fake responses from an upstream server. If your source supports this, and you opted to log multiple segments, your queries should be adjusted to prevent duplication. You can achieve this, using the following normalized query:

```kql
imDNS | where SrcIpAddre != "127.0.0.1" and NetworkDirection == "response"
```

## Parsers

The KQL functions implementing the DNS information model have the following names:

| Name | Description | More information |
| --- | --- | --- |
| **imDNS** | Aggregative parser which uses *union* to include normalized events from all DNS sources. |- Update this parser if you want to add or remove sources from source agnostic analytics. <br>- Use this function in your source agnostic queries.|
| **imDNS<vendor>** | Source specific parsers implement normalization for a specific source. For example, *imDNSWindowsMMA*. |- Add a source specific parser for a source for which there is no out of the box normalizing parser. Update the aggregative parser to include reference to your new parser. <br>- Update a source specific parser to resolve parsing and normalization issues.<br>- Use source specific parser if analytics which is source specific.|
| | | |

The parsers can be deployed from ###.

## Schema details

The DNS information model is aligned with the [OSSEM DNS entity schema](https://github.com/OTRF/OSSEM/blob/master/docs/cdm/entities/dns.md).

### Log Analytics Fields

The following fields are generated by Log Analytics for each record. You can override them when creating a custom connector. Note that Log Analytics adds additional fields, which are less relevant to security use cases and which are documented [with Azure Monitor](/en-us/azure/azure-monitor/logs/log-standard-columns).

| **Field** | **Type** | **Discussion** |
| --- | --- | --- |
| **TimeGenerated** | datetime | The time the event was generated by the reporting device. |
| **\_ResourceId** | guid | The Azure Resource ID of the reporting device or service, or the log forwarder resource ID for events forwarded using Syslog, CEF or WEF. |
| | |

### Event Fields

Event fields are fields that are common to all schemas and describe the activity itself and the reporting device.

| **Field** | **Class** | **Type** | **Example** | **Discussion** |
| --- | --- | --- | --- | --- |
| **EventMessage** | Optional | String | | A general message or description, either included in, or generated from, the record. |
| **EventCount** | Mandatory | Integer | 1 | The number of events described by the record. This value is used when the source supports aggregation, and a single record may represent multiple events. For other sources, it should be set to 1. |
| **EventStartTime** | Mandatory | Date/time | | If the source supports aggregation and the record represents multiple events, this field should specify the time the first event was generated. Otherwise should alias TimeGenerated. |
| **EventEndTime** | | Alias || Alias to TimeGenerated |
| **EventType** | Mandatory | Enumerated | lookup | Indicate the operation reported by the record. For DNS records, this would be the DNS op code (see OpCodes in the IANA [DNS Parameters documentation](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml) ). |
| **EventSubType** | Optional | Enumerated || Either "request" or "response". As discussed above, for most sources only responses are logged, and the value should be "response". |
| **EventResult** | Mandatory | Enumerated | Success | Should be any of: "Success", "Partial", "Failure", or "NA" (for Not Applicable). <br>The value may be provided in the source record using different terms which should be normalized to these values. <br>Alternatively, the source may provide only EventResultDetails which should be analyzed to derive the EventResult as discussed above. <br>If this record represents a request and not a response, set to "NA". |
| **EventResultDetails** | Mandatory | Alias | NXDOMAIN | Reason or details for the result reported in "_EventResult_". Aliases ResponseCodeName.|
| **EventOriginalUid** | Optional | String | | A unique ID of the original record, if provided by the source. |
| **EventProduct** | Mandatory | String | DNS Server | The product generating the event. This field may not be available in the source record and should be set by the parser. |
| **EventProductVersion** | Optional | String | 12.1 | The version of the product generating the event. |
| **EventVendor** | Mandatory | String | Microsoft | The vendor of the product generating the event. This field may not be available in the source record and should be set by the parser |
| **EventSchemaVersion** | Mandatory | String | 0.1 | The version of the schema document here is 0.1. |
| **EventReportUrl** | Optional | String | | A URL provided in the event for a resource that provides additional information about the event. |
| **Dvc** | Mandatory | String | 45.21.42.12 | A unique identified of the reporting device. This would be and device identifier provided by the reporting device. In many cases, such as in Syslog messages, the value included in the message can be an IP address, a hostname or an FQDN. It can be strored in ""Dvc" without identifying its type. |
| **DvcIpAddr** | Recommended | IP Address | 45.21.42.12 | The IP Address of the reporting device. If an identifier is available but the type is not known, do not use this field (see "Dvc" for details) |
| **DvcHostname** | Recommended | String | dc.contoso.loco | The hostname of the reporting device. If an identifier is available but the type is not known, do not use this field (see "Dvc" for details) |
| **AdditionalFields** | Optional | Dynamic | | If your source provides additional information worth preserving, either keep it with the original field names or create the dynamic field AdditionalFields and add to it the extra information as key/value pairs. |
| | | | | |

### DNS specific fields

The fields below are specific to DNS events. That said, many of them do have similarities in other schemas and therefore follow the same naming convention.

| **Field** | **Class** | **Type** | **Example** | **Notes** |
| --- | --- | --- | --- | --- |
| **SrcIpAddr** | Mandatory | IP Address |  192.168.12.1 | The IP address of the client sending the DNS request. For a recursive DNS request, this would typically be the reporting device, and in most cases set to "127.0.0.1". |
| **SrcPortNumber** | Optional | Integer |  54312 | Source port of the DNS query. |
| **DstIpAddr** | Optional | IP Address |  127.0.0.1 | The IP address of the server receiving the DNS request. For a regular DNS request, this would typically be the reporting device, and in most cases set to "127.0.0.1". |
| **DstPortNumber** | Optional | Integer |  53 | Destination Port number |
| **IpAddr** | | Alias | | Alias for SrcIpAddr |
| **Query** | Mandatory | String | www.malicious.con | The domain which needs to be resolved.Note that while the DNS protocol allows for multiple queries in a single request, this is rare if exist at all. If the request has multiple queries, store the first one in this field and optionally keep the rest in the "AdditionalFields" field. |
| **Domain** | | Alias || Alias to Query. |
| **QueryType** | Optional | Integer | 28 | The field may contain DNS Resource Record Type codes (See Resource Record Types in the IANA [DNS Parameters documentation](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml)). |
| **QueryTypeName** | Mandatory | Enumerated | AAAA | The field may contain DNS Resource Record Type name (See Resource Record Types in the IANA [DNS Parameters documentation](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml)).Note that IANA does not define the case for the values, so analytics should normalize the case.If the source provides only a numerical query type code and not a query type name, the parser should include a lookup table to enrich with this value. |
| **ResponseName** | Optional | String | | The content of the response as included in the record. DNS response data is inconsistent across reporting devices, is complex to parse, and has less value for source agnostics analytics. Therefore the information model does not require parsing and normalizing it. Azure Sentinel uses an auxiliary function to provide response information. Refer to the Handling DNS responses section below on for details. |
| **ResponseCodeName** |   | Alias | NXDOMAIN | The DNS response code (See RCODEs in the IANA [DNS Parameters documentation](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml)). Note that IANA does not define the case for the values, so analytics should normalize the case.If the source provides only a numerical response code and not a response code name, the parser should include a lookup table to enrich with this value. If this record represents a request and not a response, set to "NA".This field is aliased by EventStatusDetails is aliased by EventStatusDetails --> ResponseCodeName --> EventResultDetails So 4 names to the same column? I2) If you follow the documentation than NXDOMAIN is an alias to AAAA 3) Description sometimes says: A is aliased by B and sometimes X aliases Y. This is confusing. I suggest to say: in column Name: QueryTypeName [EventStatusDetails] that is ColumnName [Alias Name] 4) EventStatusDetail is referenced, but is not documented on its own ==== -->. |
| **ResponseCode** | Optional | Integer | 3 | The DNS numerical response code (See RCODEs in the IANA [DNS Parameters documentation](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml)). |
| **TransactionIdHex** | Recommended | string | | The DNS unique hex transaction id. |
| **NetworkProtocol** | Optional | string | UDP | The transport protocol used by the network resolution event. The value can be "UDP" or "TCP" and is most commonly UDP for DNS. |
| **QueryClass** | Optional | Integer | | The DNS class ID (See Resource Record Types in the IANA [DNS Parameters documentation](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml)). Note that in practice only class "IN" (id 1) is used, making this field less important. |
| **QueryClassName** | Optional | String | "IN" | The DNS class name (See Resource Record Types in the IANA [DNS Parameters documentation](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml)). Note that in practice only class "IN" (id 1) is used, making this field less important. |
| **Flags** | Optional | List of strings | ["DR"] | The flags field as provided by the reporting device. If flags information is provided in multiple fields, concatenate them with comma as a separator.Because DNS flags are complex to parse and less used by analytics the information model does not require parsing and normalizing them. Azure Sentinel uses an auxiliary function to provide flags information. Refer to the Handling DNS flags section below on for details. |
| **UrlCategory** |   | String | Educational \\ Phishing | A DNS event source may also lookup the category of the requested Domains. The field is called "_UrlCategory_" to align with the Azure Sentinel network schema. "_DomainCategory_" is added as an alias more fitting to DNS. |
| **DomainCategory** | | Alias | | Alias to UrlCategory |
| **ThreatCategory** |   | String |   | If a DNS event source also provides DNS security, it may evaluate the DNS event, for example by searching for the IP address or domain in a threat intelligence databased and may assign the domain or IP address a Threat Category. |
| **EventSeverity** | Optional | Sretring | "Informational" | If a DNS event source also provides DNS security, it may evaluate the DNS event, for example by searching for the IP address or domain in a threat intelligence databased and may assign a severity based on this evaluation. |
| **DvcAction** | Optional | String | "Blocked" | If a DNS event source also provides DNS security, it may take an action on the request, such as blocking it. |
| | | | | |

### Additional entities

| **Entity** | **Fields** | **Type** | **Mandatory fields** | **Notes** |
| --- | --- | --- | --- | --- |
| **Actor** | Actor\* | User | - | Most DNS event sources do not provide user information, which is typically not part of the DNS protocol. In some cases, the reporting device provides the user information, usually by resolving the source IP address into a user information. In such cases, represent the user as described in the schema entities documentation. Use "Actor" as a descriptor as the information is based on the source IP address. Note that when using "Actor" as an entity descriptor, there is no need to append "User". |
| **Source Device** | Src\* | Device | SrcIpAddr | DNS event sources usually report the IP address of the source of the request, and therefore SrcIpAddr is mandatory. In case that the reporting device provides more information on the source of the request, or if you enrich, use the device entity guidelines to normalize using "Src" as the fields prefix. |
| **Destination Device** | Dst\* | Device | - | DNS event sources usually do not report information about the destination of the request. In case that the reporting device provides information on the destination of the request, or if you enrich, use the device entity guidelines to normalize using "Dst" as the prefix. |
| **Reporting Device** | Dvc\* | Device | Dvc | Most events include information about the reporting device. Use |
| **Process Information** | Process\* | Process | - | Information related to the process that generated the DNS query on the client device. ||
| | | | | |

## Handling DNS response

In most cases logged DNS events do not include response information which may be large and detailed. If your record includes additional response information store it in the `_ResponseName_` field as it appears in the record.

In addition, you may provide an auxiliary KQL function called `_imDNS<vendor>Response_` that will take the unparsed response as input and will return a dynamic with the following structure:

```kql
[
    {
        "part": "answer"
        "query": "yahoo.com."
        "TTL": 1782
        "Class": "IN"
        "Type": "A"
        "Response": "74.6.231.21"
    }
    {
        "part": "authority"
        "query": "yahoo.com."
        "TTL": 113066
        "Class": "IN"
        "Type": "NS"
        "Response": "ns5.yahoo.com"
    }
    ...
]
```

The fields in each dictionary in the dynamic value correspond to the fields in each DNS respond. The "part" entry should include either "answer", "authority" or "additional" to reflect the part in the response the dictionary belongs to.

Such a function can be called only when needed, and only after initial filtering to ensure better performance.

## Handling DNS Flags

As described above, the Information Model does not require parsing and normalizing flag information. Instead, store the flags data, as provided by the reporting device, in the *_Flags_* field.

In addition, you may provide an auxiliary KQL function called "_imDNS<vendor>Flags_" that will take the unparsed response as input and will return a dynamic list with 5 Boolean values representing each flag in the following order: Authenticated (AD), Authoritative (AA), Checking Disabled (CD), Recursion Available (RA), Recursion Desired (RD), Truncated (TC), Z.

## Next steps

For more information, see:

- [Normalization in Azure Sentinel](normalization.md)
- [Azure Sentinel data normalization schema reference](normalization-schema.md)