---
title: Handle false positives in Azure Sentinel
description: Learn how to resolve false positives in Azure Sentinel by creating automation rules or modifying alert rules to specify exceptions.
author: oshezaf
ms.author: ofshezaf
ms.service: azure-sentinel
ms.topic: how-to
ms.date: 05/03/2021

---

# Handle false positives in Azure Sentinel

No detection rule is perfect. When using Azure Sentinel, you're bound to get some false positives. In this article, you learn how to handle false positives in scheduled analytics rules.

## Understand false positive prevention

False positive errors in Azure Sentinel can generate incidents where no threat actually exists. In a correctly built detection rule, false positives often stem from incorrectly including specific users or IP addresses in the rule.

Common scenarios include:

- Normal activities by certain users, usually service principals, can show a pattern that seems suspicious.
- Intentional security scanning activity coming from known IP addresses can appear malicious.
- A rule that excludes private IP addresses might also need to exclude some internal IP addresses that aren't private.

This article describes two methods for avoiding false positives:

- Use **automation rules** to create exceptions without modifying alert rules. Automation rules:
  - Let you apply the same exceptions to several alert rules.
  - Work for detections that aren't based on scheduled alert rules.
  - Allow applying exceptions for a limited time. For example, maintenance work might trigger false positives that outside the maintenance timeframe would be true incidents.
  - Keep an audit trail. The exceptions prevent incident creation, but the alerts are still recorded for audit purposes.
  - Are easily generated by analysts.
  
- **Modify scheduled alert rules** for more detailed and permanent exceptions. Rule query modifications:
  - Allow advanced boolean expressions and subnet-based exceptions.
  - Let you use watchlists to centralize exception management.
  - Typically require implementation by Security Operations Center (SOC) engineers.
  - Are the most flexible and complete solution for false positives, but can be costly.

## Add exceptions by using automation rules

The simplest way to add an exception is to use the **Add automation rule** feature when viewing a false positive incident.

To add and apply an automation rule:

1. In Azure Sentinel, under **Incidents**, select the incident you want to create an exception for.
1. Select **Create automation rule**.
1. In the **Create new automation rule** sidebar, optionally modify the new rule name to identify the exception, rather than just the alert rule name.
1. Under **Conditions**, optionally add more **Analytic rule name**s to apply the exception to.
1. The sidebar presents the specific entities in the current incident that might have caused the false positive. Keep the automatic suggestions, or modify them to fine-tune the exception. For example, you could change a condition on an IP address to apply to an entire subnet.
   
   :::image type="content" source="media/false-positives/create-rule.png" alt-text="Screenshot showing how to create an automation rule for an incident in Azure Sentinel":::
   
1. After you define the trigger, you can continue to define what the rule does:
   
   - The rule is already configured to close an incident that meets the exception criteria.
   - You can add a comment to the automatically closed incident that explains the exception. For example, you could specify that the incident originated from known administrative activity.
   - By default, the rule is set to expire automatically after 24 hours. This expiration might be what you want, and reduces the chance of false negative errors. If you want a longer exception, set **Rule expiration** to a later time.
   
1. Select **Apply**. The exception is now active.
   
   :::image type="content" source="media/false-positives/apply-rule.png" alt-text="Screenshot showing how to finish creating and applying an automation rule in Azure Sentinel":::

You can also create a new automation rule from scratch. Select **Automation** from the Azure Sentinel left navigation menu, and then select **Create** > **Add new rule**.

## Add exceptions by modifying analytics rules

Another option for implementing exceptions is to modify the analytics rule query. You can include exceptions directly in the rule, or preferably, when possible, use a reference to a watchlist. You can then manage the exception list in the watchlist.

### Modify the query

To implement an exception in a typical rule preamble, you can add a condition like `where IPAddress !in ('<ip addresses>')` near the beginning of the query. This line excludes specific IP addresses from the rule.

```kusto
let timeFrame = 1d;
SigninLogs
| where TimeGenerated >= ago(timeFrame)
| where IPAddress !in ('10.0.0.8', '192.168.12.1')
...
```

This type of exception isn't limited to IP addresses. You can exclude specific users by using the `UserPrincipalName` field, or exclude specific apps by using `AppDisplayName`.

You can exclude multiple attributes. For example, to exclude alerts from either the IP address `10.0.0.8` or the user `user@microsoft.com`, use:

```kusto
| where IPAddress !in ('10.0.0.8')
| where UserPrincipalName != 'user@microsoft.com'
```

To implement a more fine-grained exception when applicable, and reduce the chance for false negatives, you can combine attributes. The following exception applies only if both values appear in the same alert:

```kusto
| where IPAddress != '10.0.0.8' and UserPrincipalName != 'user@microsoft.com'
```

### Exclude subnets

The preceding use case requires subnet exclusion. The following example shows how to exclude subnets.

The `ipv_lookup` operator is an enrichment operator, not a filtering operator. The `where isempty(network)` line actually does the filtering, by inspecting those events that don't show a match.

```kusto
let subnets = datatable(network:string) [ "111.68.128.0/17", "5.8.0.0/19", ...];
let timeFrame = 1d;
SigninLogs
| where TimeGenerated >= ago(timeFrame)
| evaluate ipv4_lookup(subnets, IPAddress, network, return_unmatched = true)
| where isempty(network)
...
```

### Use watchlists to manage exceptions

You can use a watchlist to manage the list of exceptions outside the rule itself. When applicable, this solution has several advantages:

- An analyst can add exceptions without editing the rule, which better follows SOC best practices.
- The same watchlist can apply to several rules, enabling central exception management.

Using a watchlist is similar to using a direct exception. Use `_GetWatchlist('<watchlist name>')` to call the watchlist.

```kusto
let timeFrame = 1d;
let logonDiff = 10m;
let allowlist = (_GetWatchlist('ipallowlist') | project IPAddress);
SigninLogs
| where TimeGenerated >= ago(timeFrame)
| where IPAddress !in (allowlist)
...
```

You can also do subnet filtering by using a watchlist. For example, in the preceding subnets exclusion code, you could replace the subnets `datatable` definition with a watchlist:

```kusto
let subnets = _GetWatchlist('subnetallowlist');
```

## Next steps
- [Automate incident handling in Azure Sentinel with automation rules](automate-incident-handling-with-automation-rules.md)
- [Use Azure Sentinel watchlists](watchlists.md)

